01  EMPOYEE-RECORD.
              05  HV-EMPID		PIC X(10).
              05  HV-EMPNAME		PIC X(30).
              05  HV-DEPARTMENT         PIC X(2).
              05  HV-SALARY             PIC S9(8)V99 COMP-3.
              05  HV-DESIGNATION        PIC CHAR(4).